app/controllers/production_records_controller.rb

  def index
    @production_records = ProductionRecord.all.order(recorded_at: :desc)
---
SELECT "production_records".* FROM "production_records" WHERE "production_records"."deleted_at" IS NULL ORDER BY "production_records"."recorded_at" DESC

  def new
    @production_record = ProductionRecord.new
    @staffs = Staff.all
    @materials = Material.all
---
SELECT "staffs".* FROM "staffs"
SELECT "materials".* FROM "materials" WHERE "materials"."deleted_at" IS NULL

  def create
    @production_record = ProductionRecord.new(production_record_params)
    if @production_record.save
      redirect_to production_records_path, notice: '生産記録を登録しました'
    else
      @staffs = Staff.all
      @materials = Material.all
---
INSERT INTO "production_records" ("recorded_at", "material_id", "weight_kg", "staff_id", "status", "note", "flagged_as_anomaly", "deleted_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
SELECT "staffs".* FROM "staffs"
SELECT "materials".* FROM "materials" WHERE "materials"."deleted_at" IS NULL

  def set_production_record
    @production_record = ProductionRecord.find(params[:id])
---
SELECT "production_records".* FROM "production_records" WHERE "production_records"."deleted_at" IS NULL AND "production_records"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]